IDEA Open Model
OpenModel.GetObject Method
Compatible with IDEA StatiCa Beta 20.0
 Gets the Open element object from the Reference element
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public OpenElementId GetObject(
	ReferenceElement element
)
Public Function GetObject (
	element As ReferenceElement
) As OpenElementId
Parameters
element
Type: IdeaRS.OpenModel.ReferenceElement
Reference element
Return Value
Type: OpenElementId
The instance of OpenElementId object
See Also
Reference
OpenModel Class
IdeaRS.OpenModel Namespace